## ANSWERS TO STAGE A QUIZ QUESTIONS

In [1]:
import pandas as pd
import numpy as np

In [2]:
# Question 1
lst = [[35, 'Portugal', 94], [33, 'Argentina', 93], [30 , 'Brazil', 92]]

col = ['Age','Nationality', 'Overall']

In [3]:
pd.DataFrame(lst, columns=col, index=[o for o in range(1,4)])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [4]:
pd.DataFrame(lst, columns=col, index=[1,2,3])

   Age Nationality  Overall
1   35    Portugal       94
2   33   Argentina       93
3   30      Brazil       92

In [5]:
# Question 2 - Given the following numpy array:

array  = ([
            [94, 89, 63],
            [93, 92, 48],
            [92, 94, 56]
        ])

# How would you select  the elements in bold and italics from the array?

In [6]:
np.array(array)

array([[94, 89, 63],
       [93, 92, 48],
       [92, 94, 56]])

In [7]:
np.array(array)[:2,1:]

array([[89, 63],
       [92, 48]])

In [8]:
# Question 5 What would be the output for?

S = [['him', 'sell'], [90, 28, 43]]

S[0][1][1]

'e'

In [9]:
# Question 6 - Given the following python code, what would the output of the code give?

my_tuppy = (1,2,5,8)

my_tuppy[2] = 6

TypeError: 'tuple' object does not support item assignment

In [10]:
# Question 7 - Consider the following list of tuples:

y = [(2, 4), (7, 8), (1, 5, 9)]

# How would you assign element 8 from the list to a variable x?

x = y[1][1]
print(x)

8

In [11]:
# Question 8
# Which of these python data structures is unorderly?


# set and dict in python is unordered (meaning the items in them are randomly stored and there is no definite position) and mutable.

In [12]:
# Question 9
# A pandas Dataframe with dimensions (100,3) has how many features and observations?


# ans: 3 features. 100 observations

In [13]:
file = 'https://github.com/HamoyeHQ/HDSC-Introduction-to-Python-for-machine-learning/files/7768140/FoodBalanceSheets_E_Africa_NOFLAG.csv'
food = pd.read_csv(file, encoding='latin-1')
food.head()

,Area Code,Area,Item Code,Item,Element Code,Element,Unit,Y2014,Y2015,Y2016,Y2017,Y2018
0,4,Algeria,2501,Population,511,Total Population - Both sexes,1000 persons,38924.00,39728.00,40551.00,41389.00,42228.00
1,4,Algeria,2501,Population,5301,Domestic supply quantity,1000 tonnes,0.00,0.00,0.00,0.00,0.00
2,4,Algeria,2901,Grand Total,664,Food supply (kcal/capita/day),kcal/capita/day,3377.00,3379.00,3372.00,3341.00,3322.00
3,4,Algeria,2901,Grand Total,674,Protein supply quantity (g/capita/day),g/capita/day,94.90,94.35,94.72,92.82,91.83
4,4,Algeria,2901,Grand Total,684,Fat supply quantity (g/capita/day),g/capita/day,80.06,79.36,77.40,80.19,77.28

In [14]:
# check file info
food.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 60943 entries, 0 to 60942
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Area Code     60943 non-null  int64
 1   Area          60943 non-null  object
 2   Item Code     60943 non-null  int64
 3   Item          60943 non-null  object
 4   Element Code  60943 non-null  int64
 5   Element       60943 non-null  object
 6   Unit          60943 non-null  object
 7   Y2014         59354 non-null  float64
 8   Y2015         59395 non-null  float64
 9   Y2016         59408 non-null  float64
 10  Y2017         59437 non-null  float64
 11  Y2018         59507 non-null  float64
dtypes: float64(5), int64(3), object(4)
memory usage: 5.6+ MB

In [15]:
# Question 11
# Answer the following questions based on the African food production dataset provided by the FAO website already provided
# What is the total sum of Animal Fat produced in 2014 and 2017 respectively?
# Hint: # Perform a groupby sum aggregation on ‘Item’

food.groupby('Item').sum()[['Y2014', 'Y2017']].loc['Animal fats']

Y2014    209460.54
Y2017    269617.53
Name: Animal fats, dtype: float64

In [16]:
# Question 12
# What is the mean and standard deviation across the whole dataset for the year 2015 to 3 decimal places?

food.describe().T.loc['Y2015']

count     59395.000000
mean        135.235966
std        1603.403984
min       -3161.000000
25%           0.000000
50%           0.080000
75%           8.460000
max      181137.000000
Name: Y2015, dtype: float64

In [17]:
# Question 13
# What is the total number and percentage of missing data in 2016 to 2 decimal places?


print(food.isnull().sum(), '\n')
print(food.isnull().mean() *100)

Area Code          0
Area               0
Item Code          0
Item               0
Element Code       0
Element            0
Unit               0
Y2014           1589
Y2015           1548
Y2016           1535
Y2017           1506
Y2018           1436
dtype: int64

Area Code       0.000000
Area            0.000000
Item Code       0.000000
Item            0.000000
Element Code    0.000000
Element         0.000000
Unit            0.000000
Y2014           2.607354
Y2015           2.540078
Y2016           2.518747
Y2017           2.471162
Y2018           2.356300
dtype: float64

In [18]:
# Question 14
# Which year had the highest correlation with ‘Element Code’? 


food.corr()['Element Code'].sort_values(ascending=False)

Element Code    1.000000
Y2014           0.024457
Y2018           0.024279
Y2017           0.024254
Y2015           0.023889
Y2016           0.023444
Area Code      -0.000209
Item Code      -0.024683
Name: Element Code, dtype: float64

In [19]:
# Question 15
# What year has the highest sum of Import Quantity?
# Hint- Perform a groupby operation on ‘Element’ and use the resulting Dataframe to answer the question


food.groupby('Element').sum().loc['Import Quantity']

Area Code         688174.00
Item Code       13795966.00
Element Code    28834929.00
Y2014             274144.48
Y2015             267018.46
Y2016             286582.78
Y2017             294559.09
Y2018             287997.09
Name: Import Quantity, dtype: float64

In [20]:
# Question 16
# What is the total number of the sum of Production in 2014?
# Hint- Perform a groupby operation on ‘Element’ and use the resulting Dataframe to answer the question

food.groupby('Element').sum().loc['Production']
# food.groupby('Element').sum().loc['Production', 'Y2014']

Area Code         526751.00
Item Code       10450053.00
Element Code    21388191.00
Y2014            1931287.75
Y2015            1947019.39
Y2016            1943537.15
Y2017            2030056.89
Y2018            2075072.89
Name: Production, dtype: float64

In [21]:
# Question 17
# Which of these elements had the highest sum in 2018?
# Hint-  Select columns ‘Y2018’ and ‘Element’, Perform a groupby operation on ‘Element’ on the selected dataframe

food[['Y2018', 'Element']].groupby('Element').sum().sort_values(by='Y2018', ascending=False)

                                             Y2018
Element
Domestic supply quantity                2161192.10
Production                              2075072.89
Food                                    1303841.28
Total Population - Both sexes           1140605.00
Food supply (kcal/capita/day)            455261.00
Processing                               308429.00
Import Quantity                          287997.09
Feed                                     233489.68
Export Quantity                          181594.80
Losses                                   163902.00
Other uses (non-food)                     91300.97
Food supply quantity (kg/capita/yr)       49056.85
Residuals                                 34864.00
Seed                                      25263.14
Stock Variation                           20577.91
Protein supply quantity (g/capita/day)    11833.56
Fat supply quantity (g/capita/day)        10258.69
Tourist consumption                          90.00

In [22]:
# Question 18
# Which of these elements had the 3rd lowest sum in 2018?
# Hint-  Select columns ‘Y2018’ and ‘Element’, Perform a groupby operation on ‘Element’ on the selected dataframe

food[['Y2018', 'Element']].groupby('Element').sum().sort_values(by='Y2018')[:3]

                                           Y2018
Element
Tourist consumption                        90.00
Fat supply quantity (g/capita/day)      10258.69
Protein supply quantity (g/capita/day)  11833.56

In [23]:
# Question 19
# What is the total Import Quantity in Algeria in 2018?

# food.groupby(['Area', 'Element']).sum().loc[('Algeria', 'Import Quantity')]
food.groupby(['Area', 'Element']).sum().loc[('Algeria', 'Import Quantity'), 'Y2018']

36238.29

In [22]:
# Question 20
# What is the total number of unique countries in the dataset?

food.Area.nunique()

49